// ==========================
// dialogues.js
// PROJECT DERBY Ver.2.2
// 会話データ
// ==========================

const companyDialogue = [

{
    place:"会社・昼休み",
    name:"先輩",
    text:"今週、日本ダービーがあるんだ。"
},

{
    place:"会社・昼休み",
    name:"主人公",
    text:"ダービー？"
},

{
    place:"会社・昼休み",
    name:"先輩",
    text:"競馬の日本ダービーだよ。"
},

{
    place:"会社・昼休み",
    name:"主人公",
    text:"競馬って儲かるんですか？"
},

{
    place:"会社・昼休み",
    name:"先輩",
    text:"当たればね。"
},

{
    place:"会社・昼休み",
    name:"先輩",
    text:"でも競馬の面白さは、それだけじゃない。"
},

{
    place:"会社・昼休み",
    name:"先輩",
    text:"一度競馬場へ行ってみると分かるよ。"
},

{
    place:"会社・昼休み",
    name:"主人公",
    text:"そんなに違うものなんですか？"
},

{
    place:"会社・昼休み",
    name:"先輩",
    text:"日曜日、一緒に行こう。"

}

];