// ==========================
// dialogues.js
// PROJECT DERBY Ver.2.2
// 会話データ
// ==========================

const companyDialogue = [

{
    place:"会社・昼休み",
    name:"先輩",
    text:"今週、日本ダービーがあるんだ。"
},

{
    place:"会社・昼休み",
    name:"主人公",
    text:"ダービー？"
},

{
    place:"会社・昼休み",
    name:"先輩",
    text:"競馬の日本ダービーだよ。"
},

{
    place:"会社・昼休み",
    name:"主人公",
    text:"競馬って儲かるんですか？"
},

{
    place:"会社・昼休み",
    name:"先輩",
    text:"当たればね。"
},

{
    place:"会社・昼休み",
    name:"先輩",
    text:"でも競馬の面白さは、それだけじゃない。"
},

{
    place:"会社・昼休み",
    name:"先輩",
    text:"一度競馬場へ行ってみると分かるよ。"
},

{
    place:"会社・昼休み",
    name:"主人公",
    text:"そんなに違うものなんですか？"
},

{
    place:"会社・昼休み",
    name:"先輩",
    text:"日曜日、一緒に行こう。"

}

];
// ==========================
// 初心者講座
// ==========================

const beginnerDialogue = [

{
    place:"競馬教室",
    name:"先生",
    text:"競馬の世界へようこそ！"
},

{
    place:"競馬教室",
    name:"先生",
    text:"競馬は馬の速さだけで勝敗が決まるスポーツではありません。"
},

{
    place:"競馬教室",
    name:"先生",
    text:"脚質・調教・パドック・騎手など、多くの要素が結果に影響します。"
},

{
    place:"競馬教室",
    name:"先生",
    text:"このゲームでは一つずつ学びながら競馬を楽しんでいきます。"
},

{
    place:"競馬教室",
    name:"先生",
    text:"まずは『脚質』から勉強していきましょう！"
}

];